bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/soc/audio_reg_reg.h
// Copyright 2022-2023 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// This is a generated file, if you need to modify it, use the script to
// generate and modify all the struct.h, ll.h, reg.h, debug_dump.c files!

#pragma once


#ifdef __cplusplus
extern "C" {
#endif


#define AUDIO_REG_DEVICE_ID_ADDR (SOC_AUDIO_REG_REG_BASE + (0x0 << 2))

#define AUDIO_REG_DEVICE_ID_DEVICE_ID_POS (0)
#define AUDIO_REG_DEVICE_ID_DEVICE_ID_MASK (0xffffffff)

#define AUDIO_REG_VERSION_ID_ADDR (SOC_AUDIO_REG_REG_BASE + (0x1 << 2))

#define AUDIO_REG_VERSION_ID_VERSION_ID_POS (0)
#define AUDIO_REG_VERSION_ID_VERSION_ID_MASK (0xffffffff)

#define AUDIO_REG_RESERVED0_ADDR (SOC_AUDIO_REG_REG_BASE + (0x2 << 2))

#define AUDIO_REG_RESERVED0_RESERVED0_POS (0)
#define AUDIO_REG_RESERVED0_RESERVED0_MASK (0xffffffff)

#define AUDIO_REG_RESERVED1_ADDR (SOC_AUDIO_REG_REG_BASE + (0x3 << 2))

#define AUDIO_REG_RESERVED1_RESERVED1_POS (0)
#define AUDIO_REG_RESERVED1_RESERVED1_MASK (0xffffffff)

#define AUDIO_REG_SYS_CFG_ADDR (SOC_AUDIO_REG_REG_BASE + (0x4 << 2))

#define AUDIO_REG_SYS_CFG_DIGMIC_EN_POS (0)
#define AUDIO_REG_SYS_CFG_DIGMIC_EN_MASK (0x1f)

#define AUDIO_REG_SYS_CFG_DMIC_SEL_POS (5)
#define AUDIO_REG_SYS_CFG_DMIC_SEL_MASK (0x7)

#define AUDIO_REG_SYS_CFG_SPL_SEL_ADC_POS (8)
#define AUDIO_REG_SYS_CFG_SPL_SEL_ADC_MASK (0x3)

#define AUDIO_REG_SYS_CFG_RESERVED_BIT_10_17_POS (10)
#define AUDIO_REG_SYS_CFG_RESERVED_BIT_10_17_MASK (0xff)

#define AUDIO_REG_SYS_CFG_MEM_DAC_IIR1X_SW_INIT_POS (18)
#define AUDIO_REG_SYS_CFG_MEM_DAC_IIR1X_SW_INIT_MASK (0x1)

#define AUDIO_REG_SYS_CFG_MEM_AUTO_INIT_TRIG_POS (19)
#define AUDIO_REG_SYS_CFG_MEM_AUTO_INIT_TRIG_MASK (0x1)

#define AUDIO_REG_SYS_CFG_MEM_DAC_SW_INIT_POS (20)
#define AUDIO_REG_SYS_CFG_MEM_DAC_SW_INIT_MASK (0x1)

#define AUDIO_REG_SYS_CFG_MEM_MIC_SW_INIT_POS (21)
#define AUDIO_REG_SYS_CFG_MEM_MIC_SW_INIT_MASK (0x1)

#define AUDIO_REG_SYS_CFG_MEM_ANC_SW_INIT_POS (22)
#define AUDIO_REG_SYS_CFG_MEM_ANC_SW_INIT_MASK (0x1)

#define AUDIO_REG_SYS_CFG_CLK_MIC_SEL_POS (23)
#define AUDIO_REG_SYS_CFG_CLK_MIC_SEL_MASK (0x3)

#define AUDIO_REG_SYS_CFG_RX_SP_SEL_POS (25)
#define AUDIO_REG_SYS_CFG_RX_SP_SEL_MASK (0xf)

#define AUDIO_REG_SYS_CFG_MEM_DAC_EQ_SW_INIT_POS (29)
#define AUDIO_REG_SYS_CFG_MEM_DAC_EQ_SW_INIT_MASK (0x1)

#define AUDIO_REG_SYS_CFG_MEM_DAC_COMP_SW_INIT_POS (30)
#define AUDIO_REG_SYS_CFG_MEM_DAC_COMP_SW_INIT_MASK (0x1)

#define AUDIO_REG_SYS_CFG_APB_CLK_EN_DIS_POS (31)
#define AUDIO_REG_SYS_CFG_APB_CLK_EN_DIS_MASK (0x1)

#define AUDIO_REG_A2DP_COMP_ADDR (SOC_AUDIO_REG_REG_BASE + (0x5 << 2))

#define AUDIO_REG_A2DP_COMP_ANC_COMP_ST_VAL_POS (0)
#define AUDIO_REG_A2DP_COMP_ANC_COMP_ST_VAL_MASK (0x3ff)

#define AUDIO_REG_A2DP_COMP_RESERVED_BIT_10_30_POS (10)
#define AUDIO_REG_A2DP_COMP_RESERVED_BIT_10_30_MASK (0x1fffff)

#define AUDIO_REG_A2DP_COMP_ANC_COMP_EN_FRC_POS (31)
#define AUDIO_REG_A2DP_COMP_ANC_COMP_EN_FRC_MASK (0x1)

#define AUDIO_REG_ADC_CFG_ADDR (SOC_AUDIO_REG_REG_BASE + (0x6 << 2))

#define AUDIO_REG_ADC_CFG_AEC_EN_POS (0)
#define AUDIO_REG_ADC_CFG_AEC_EN_MASK (0x3)

#define AUDIO_REG_ADC_CFG_RESERVED_BIT_2_2_POS (2)
#define AUDIO_REG_ADC_CFG_RESERVED_BIT_2_2_MASK (0x1)

#define AUDIO_REG_ADC_CFG_ADC_16B_SEL_POS (3)
#define AUDIO_REG_ADC_CFG_ADC_16B_SEL_MASK (0x1f)

#define AUDIO_REG_ADC_CFG_AEC_16B_SEL_POS (8)
#define AUDIO_REG_ADC_CFG_AEC_16B_SEL_MASK (0x3)

#define AUDIO_REG_ADC_CFG_RESERVED_BIT_10_11_POS (10)
#define AUDIO_REG_ADC_CFG_RESERVED_BIT_10_11_MASK (0x3)

#define AUDIO_REG_ADC_CFG_ADC_EN_POS (12)
#define AUDIO_REG_ADC_CFG_ADC_EN_MASK (0x1f)

#define AUDIO_REG_ADC_CFG_RESERVED_BIT_17_24_POS (17)
#define AUDIO_REG_ADC_CFG_RESERVED_BIT_17_24_MASK (0xff)

#define AUDIO_REG_ADC_CFG_ADC_LPF_BPS1_POS (25)
#define AUDIO_REG_ADC_CFG_ADC_LPF_BPS1_MASK (0x1)

#define AUDIO_REG_ADC_CFG_ADC_LPF_BPS2_POS (26)
#define AUDIO_REG_ADC_CFG_ADC_LPF_BPS2_MASK (0x1)

#define AUDIO_REG_ADC_CFG_ADC_LPF_BPS3_POS (27)
#define AUDIO_REG_ADC_CFG_ADC_LPF_BPS3_MASK (0x1)

#define AUDIO_REG_ADC_CFG_ADC_HPF_BPS_POS (28)
#define AUDIO_REG_ADC_CFG_ADC_HPF_BPS_MASK (0x1)

#define AUDIO_REG_ADC_CFG_RESERVED_BIT_29_29_POS (29)
#define AUDIO_REG_ADC_CFG_RESERVED_BIT_29_29_MASK (0x1)

#define AUDIO_REG_ADC_CFG_CLK_ADC_INV_POS (30)
#define AUDIO_REG_ADC_CFG_CLK_ADC_INV_MASK (0x1)

#define AUDIO_REG_ADC_CFG_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_ADC_CFG_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_ANC_CFG_ADDR (SOC_AUDIO_REG_REG_BASE + (0x7 << 2))

#define AUDIO_REG_ANC_CFG_ANC_FRC_ON_POS (0)
#define AUDIO_REG_ANC_CFG_ANC_FRC_ON_MASK (0x1)

#define AUDIO_REG_ANC_CFG_ANC0_RAMP_BPS_POS (1)
#define AUDIO_REG_ANC_CFG_ANC0_RAMP_BPS_MASK (0x7)

#define AUDIO_REG_ANC_CFG_ANC1_RAMP_BPS_POS (4)
#define AUDIO_REG_ANC_CFG_ANC1_RAMP_BPS_MASK (0x7)

#define AUDIO_REG_ANC_CFG_ANC0_RAMP_DOWN_TRIG_POS (7)
#define AUDIO_REG_ANC_CFG_ANC0_RAMP_DOWN_TRIG_MASK (0x7)

#define AUDIO_REG_ANC_CFG_ANC1_RAMP_DOWN_TRIG_POS (10)
#define AUDIO_REG_ANC_CFG_ANC1_RAMP_DOWN_TRIG_MASK (0x7)

#define AUDIO_REG_ANC_CFG_ANC_RAMP_CFG_POS (13)
#define AUDIO_REG_ANC_CFG_ANC_RAMP_CFG_MASK (0x7)

#define AUDIO_REG_ANC_CFG_ANC_CIC_SETP_3_POS (16)
#define AUDIO_REG_ANC_CFG_ANC_CIC_SETP_3_MASK (0x1)

#define AUDIO_REG_ANC_CFG_DAC_CIC_STEP_2_POS (17)
#define AUDIO_REG_ANC_CFG_DAC_CIC_STEP_2_MASK (0x1)

#define AUDIO_REG_ANC_CFG_ANC0_RAMP_UP_TRIG_POS (18)
#define AUDIO_REG_ANC_CFG_ANC0_RAMP_UP_TRIG_MASK (0x7)

#define AUDIO_REG_ANC_CFG_ANC1_RAMP_UP_TRIG_POS (21)
#define AUDIO_REG_ANC_CFG_ANC1_RAMP_UP_TRIG_MASK (0x7)

#define AUDIO_REG_ANC_CFG_RESERVED_BIT_24_25_POS (24)
#define AUDIO_REG_ANC_CFG_RESERVED_BIT_24_25_MASK (0x3)

#define AUDIO_REG_ANC_CFG_ANC_EN0_POS (26)
#define AUDIO_REG_ANC_CFG_ANC_EN0_MASK (0x7)

