bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/soc/audio_reg_reg.h
#define AUDIO_REG_ANC_CFG_ANC_EN1_POS (29)
#define AUDIO_REG_ANC_CFG_ANC_EN1_MASK (0x7)

#define AUDIO_REG_DAC_CFG_ADDR (SOC_AUDIO_REG_REG_BASE + (0x8 << 2))

#define AUDIO_REG_DAC_CFG_RESERVED_0_0_POS (0)
#define AUDIO_REG_DAC_CFG_RESERVED_0_0_MASK (0x1)

#define AUDIO_REG_DAC_CFG_DAC_ENABLE_L_POS (1)
#define AUDIO_REG_DAC_CFG_DAC_ENABLE_L_MASK (0x1)

#define AUDIO_REG_DAC_CFG_DAC_ENABLE_R_POS (2)
#define AUDIO_REG_DAC_CFG_DAC_ENABLE_R_MASK (0x1)

#define AUDIO_REG_DAC_CFG_DAC_IIR_BPS_POS (3)
#define AUDIO_REG_DAC_CFG_DAC_IIR_BPS_MASK (0x1)

#define AUDIO_REG_DAC_CFG_DAC_LPF_BPS1_POS (4)
#define AUDIO_REG_DAC_CFG_DAC_LPF_BPS1_MASK (0x1)

#define AUDIO_REG_DAC_CFG_DAC_LPF_BPS2_POS (5)
#define AUDIO_REG_DAC_CFG_DAC_LPF_BPS2_MASK (0x1)

#define AUDIO_REG_DAC_CFG_DAC_LPF_BPS3_POS (6)
#define AUDIO_REG_DAC_CFG_DAC_LPF_BPS3_MASK (0x1)

#define AUDIO_REG_DAC_CFG_DAC_TX_ANC_D2_POS (7)
#define AUDIO_REG_DAC_CFG_DAC_TX_ANC_D2_MASK (0x3)

#define AUDIO_REG_DAC_CFG_DAC_16B_SEL_POS (9)
#define AUDIO_REG_DAC_CFG_DAC_16B_SEL_MASK (0x7)

#define AUDIO_REG_DAC_CFG_RESERVED_BIT_12_12_POS (12)
#define AUDIO_REG_DAC_CFG_RESERVED_BIT_12_12_MASK (0x1)

#define AUDIO_REG_DAC_CFG_DAC_SPL_SEL_POS (13)
#define AUDIO_REG_DAC_CFG_DAC_SPL_SEL_MASK (0x1)

#define AUDIO_REG_DAC_CFG_RESERVED_BIT_14_14_POS (14)
#define AUDIO_REG_DAC_CFG_RESERVED_BIT_14_14_MASK (0x1)

#define AUDIO_REG_DAC_CFG_DAC_HPF_BPS_POS (15)
#define AUDIO_REG_DAC_CFG_DAC_HPF_BPS_MASK (0x1)

#define AUDIO_REG_DAC_CFG_STEREO_EN_POS (16)
#define AUDIO_REG_DAC_CFG_STEREO_EN_MASK (0x7)

#define AUDIO_REG_DAC_CFG_RESERVED_BIT_19_21_POS (19)
#define AUDIO_REG_DAC_CFG_RESERVED_BIT_19_21_MASK (0x7)

#define AUDIO_REG_DAC_CFG_SPK2MIC_TST_POS (22)
#define AUDIO_REG_DAC_CFG_SPK2MIC_TST_MASK (0x1)

#define AUDIO_REG_DAC_CFG_MONO_SEL_POS (23)
#define AUDIO_REG_DAC_CFG_MONO_SEL_MASK (0x7)

#define AUDIO_REG_DAC_CFG_HINT_SPL_SEL_POS (26)
#define AUDIO_REG_DAC_CFG_HINT_SPL_SEL_MASK (0x3)

#define AUDIO_REG_DAC_CFG_CALL_SPL_SEL_POS (28)
#define AUDIO_REG_DAC_CFG_CALL_SPL_SEL_MASK (0x3)

#define AUDIO_REG_DAC_CFG_DITH_EN_POS (30)
#define AUDIO_REG_DAC_CFG_DITH_EN_MASK (0x1)

#define AUDIO_REG_DAC_CFG_CLK_DAC_INV_POS (31)
#define AUDIO_REG_DAC_CFG_CLK_DAC_INV_MASK (0x1)

#define AUDIO_REG_ADC_CIC_COEF0_ADDR (SOC_AUDIO_REG_REG_BASE + (0x9 << 2))

#define AUDIO_REG_ADC_CIC_COEF0_REG_CIC_COEF0_POS (0)
#define AUDIO_REG_ADC_CIC_COEF0_REG_CIC_COEF0_MASK (0x3ffff)

#define AUDIO_REG_ADC_CIC_COEF0_RESERVED_BIT_18_31_POS (18)
#define AUDIO_REG_ADC_CIC_COEF0_RESERVED_BIT_18_31_MASK (0x3fff)

#define AUDIO_REG_ADC_CIC_COEF1_ADDR (SOC_AUDIO_REG_REG_BASE + (0xa << 2))

#define AUDIO_REG_ADC_CIC_COEF1_REG_CIC_COEF1_POS (0)
#define AUDIO_REG_ADC_CIC_COEF1_REG_CIC_COEF1_MASK (0x3ffff)

#define AUDIO_REG_ADC_CIC_COEF1_RESERVED_BIT_18_31_POS (18)
#define AUDIO_REG_ADC_CIC_COEF1_RESERVED_BIT_18_31_MASK (0x3fff)

#define AUDIO_REG_ADC_CIC_COEF2_ADDR (SOC_AUDIO_REG_REG_BASE + (0xb << 2))

#define AUDIO_REG_ADC_CIC_COEF2_REG_CIC_COEF2_POS (0)
#define AUDIO_REG_ADC_CIC_COEF2_REG_CIC_COEF2_MASK (0x3ffff)

#define AUDIO_REG_ADC_CIC_COEF2_RESERVED_BIT_18_31_POS (18)
#define AUDIO_REG_ADC_CIC_COEF2_RESERVED_BIT_18_31_MASK (0x3fff)

#define AUDIO_REG_ADC_CIC_COEF3_ADDR (SOC_AUDIO_REG_REG_BASE + (0xc << 2))

#define AUDIO_REG_ADC_CIC_COEF3_REG_CIC_COEF3_POS (0)
#define AUDIO_REG_ADC_CIC_COEF3_REG_CIC_COEF3_MASK (0x3ffff)

#define AUDIO_REG_ADC_CIC_COEF3_RESERVED_BIT_18_31_POS (18)
#define AUDIO_REG_ADC_CIC_COEF3_RESERVED_BIT_18_31_MASK (0x3fff)

#define AUDIO_REG_ADC_CIC_COEF4_ADDR (SOC_AUDIO_REG_REG_BASE + (0xd << 2))

#define AUDIO_REG_ADC_CIC_COEF4_REG_CIC_COEF4_POS (0)
#define AUDIO_REG_ADC_CIC_COEF4_REG_CIC_COEF4_MASK (0x3ffff)

#define AUDIO_REG_ADC_CIC_COEF4_RESERVED_BIT_18_31_POS (18)
#define AUDIO_REG_ADC_CIC_COEF4_RESERVED_BIT_18_31_MASK (0x3fff)

#define AUDIO_REG_ADC_CIC_COEF5_ADDR (SOC_AUDIO_REG_REG_BASE + (0xe << 2))

#define AUDIO_REG_ADC_CIC_COEF5_REG_CIC_COEF5_POS (0)
#define AUDIO_REG_ADC_CIC_COEF5_REG_CIC_COEF5_MASK (0x3ffff)

#define AUDIO_REG_ADC_CIC_COEF5_RESERVED_BIT_18_31_POS (18)
#define AUDIO_REG_ADC_CIC_COEF5_RESERVED_BIT_18_31_MASK (0x3fff)

#define AUDIO_REG_ADC_CIC_COEF6_ADDR (SOC_AUDIO_REG_REG_BASE + (0xf << 2))

#define AUDIO_REG_ADC_CIC_COEF6_REG_CIC_COEF6_POS (0)
#define AUDIO_REG_ADC_CIC_COEF6_REG_CIC_COEF6_MASK (0x3ffff)

#define AUDIO_REG_ADC_CIC_COEF6_RESERVED_BIT_18_31_POS (18)
#define AUDIO_REG_ADC_CIC_COEF6_RESERVED_BIT_18_31_MASK (0x3fff)

#define AUDIO_REG_ADC_CIC_COEF7_ADDR (SOC_AUDIO_REG_REG_BASE + (0x10 << 2))

#define AUDIO_REG_ADC_CIC_COEF7_REG_CIC_COEF7_POS (0)
#define AUDIO_REG_ADC_CIC_COEF7_REG_CIC_COEF7_MASK (0x3ffff)

#define AUDIO_REG_ADC_CIC_COEF7_RESERVED_BIT_18_31_POS (18)
#define AUDIO_REG_ADC_CIC_COEF7_RESERVED_BIT_18_31_MASK (0x3fff)

#define AUDIO_REG_MIC1_DBG_CTRL_ADDR (SOC_AUDIO_REG_REG_BASE + (0x11 << 2))

#define AUDIO_REG_MIC1_DBG_CTRL_RESERVED_BIT_0_3_POS (0)
#define AUDIO_REG_MIC1_DBG_CTRL_RESERVED_BIT_0_3_MASK (0xf)

#define AUDIO_REG_MIC1_DBG_CTRL_SPK2MIC_DBG_EN_POS (4)
#define AUDIO_REG_MIC1_DBG_CTRL_SPK2MIC_DBG_EN_MASK (0xff)

#define AUDIO_REG_MIC1_DBG_CTRL_RESERVED_BIT_12_15_POS (12)
#define AUDIO_REG_MIC1_DBG_CTRL_RESERVED_BIT_12_15_MASK (0xf)

#define AUDIO_REG_MIC1_DBG_CTRL_DAC_CFG_ANC_ADD_POS (16)
#define AUDIO_REG_MIC1_DBG_CTRL_DAC_CFG_ANC_ADD_MASK (0xf)

#define AUDIO_REG_MIC1_DBG_CTRL_DAC_CFG_DAC_ADD_POS (20)
#define AUDIO_REG_MIC1_DBG_CTRL_DAC_CFG_DAC_ADD_MASK (0x3)

#define AUDIO_REG_MIC1_DBG_CTRL_RESERVED_BIT_22_31_POS (22)
#define AUDIO_REG_MIC1_DBG_CTRL_RESERVED_BIT_22_31_MASK (0x3ff)

#define AUDIO_REG_BUF_CTRL_ADDR (SOC_AUDIO_REG_REG_BASE + (0x12 << 2))

#define AUDIO_REG_BUF_CTRL_EN_SPK0_POS (0)
#define AUDIO_REG_BUF_CTRL_EN_SPK0_MASK (0x7)

#define AUDIO_REG_BUF_CTRL_EN_SPK1_POS (3)
#define AUDIO_REG_BUF_CTRL_EN_SPK1_MASK (0x7)

#define AUDIO_REG_BUF_CTRL_EN_MIC_POS (6)
#define AUDIO_REG_BUF_CTRL_EN_MIC_MASK (0x3)

