bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/soc/audio_reg_reg.h
#define AUDIO_REG_BUF_CTRL_RESERVED_BIT_8_10_POS (8)
#define AUDIO_REG_BUF_CTRL_RESERVED_BIT_8_10_MASK (0x7)

#define AUDIO_REG_BUF_CTRL_DMA_MASK_SPK0_POS (11)
#define AUDIO_REG_BUF_CTRL_DMA_MASK_SPK0_MASK (0x7)

#define AUDIO_REG_BUF_CTRL_DMA_MASK_SPK1_POS (14)
#define AUDIO_REG_BUF_CTRL_DMA_MASK_SPK1_MASK (0x7)

#define AUDIO_REG_BUF_CTRL_DMA_MASK_MIC_POS (17)
#define AUDIO_REG_BUF_CTRL_DMA_MASK_MIC_MASK (0x3)

#define AUDIO_REG_BUF_CTRL_RESERVED_BIT_19_31_POS (19)
#define AUDIO_REG_BUF_CTRL_RESERVED_BIT_19_31_MASK (0x1fff)

#define AUDIO_REG_MIC_FIFO_CFG_ADDR (SOC_AUDIO_REG_REG_BASE + (0x13 << 2))

#define AUDIO_REG_MIC_FIFO_CFG_MIC0_WR_THRD_POS (0)
#define AUDIO_REG_MIC_FIFO_CFG_MIC0_WR_THRD_MASK (0x7f)

#define AUDIO_REG_MIC_FIFO_CFG_RESERVED_BIT_7_7_POS (7)
#define AUDIO_REG_MIC_FIFO_CFG_RESERVED_BIT_7_7_MASK (0x1)

#define AUDIO_REG_MIC_FIFO_CFG_MIC0_RD_THRD_POS (8)
#define AUDIO_REG_MIC_FIFO_CFG_MIC0_RD_THRD_MASK (0x7f)

#define AUDIO_REG_MIC_FIFO_CFG_MIC1_WR_THRD_POS (15)
#define AUDIO_REG_MIC_FIFO_CFG_MIC1_WR_THRD_MASK (0xf)

#define AUDIO_REG_MIC_FIFO_CFG_RESERVED_BIT_19_19_POS (19)
#define AUDIO_REG_MIC_FIFO_CFG_RESERVED_BIT_19_19_MASK (0x1)

#define AUDIO_REG_MIC_FIFO_CFG_MIC1_RD_THRD_POS (20)
#define AUDIO_REG_MIC_FIFO_CFG_MIC1_RD_THRD_MASK (0xf)

#define AUDIO_REG_MIC_FIFO_CFG_RESERVED_BIT_24_31_POS (24)
#define AUDIO_REG_MIC_FIFO_CFG_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_REG_SPK0_FIFO_CFG_ADDR (SOC_AUDIO_REG_REG_BASE + (0x14 << 2))

#define AUDIO_REG_SPK0_FIFO_CFG_SPK0_HINT_WR_THRD_POS (0)
#define AUDIO_REG_SPK0_FIFO_CFG_SPK0_HINT_WR_THRD_MASK (0xf)

#define AUDIO_REG_SPK0_FIFO_CFG_SPK0_HINT_RD_THRD_POS (4)
#define AUDIO_REG_SPK0_FIFO_CFG_SPK0_HINT_RD_THRD_MASK (0xf)

#define AUDIO_REG_SPK0_FIFO_CFG_SPK0_CALL_WR_THRD_POS (8)
#define AUDIO_REG_SPK0_FIFO_CFG_SPK0_CALL_WR_THRD_MASK (0xf)

#define AUDIO_REG_SPK0_FIFO_CFG_SPK0_CALL_RD_THRD_POS (12)
#define AUDIO_REG_SPK0_FIFO_CFG_SPK0_CALL_RD_THRD_MASK (0xf)

#define AUDIO_REG_SPK0_FIFO_CFG_SPK0_A2DP_WR_THRD_POS (16)
#define AUDIO_REG_SPK0_FIFO_CFG_SPK0_A2DP_WR_THRD_MASK (0xf)

#define AUDIO_REG_SPK0_FIFO_CFG_SPK0_A2DP_RD_THRD_POS (20)
#define AUDIO_REG_SPK0_FIFO_CFG_SPK0_A2DP_RD_THRD_MASK (0xf)

#define AUDIO_REG_SPK0_FIFO_CFG_RESERVED_BIT_24_31_POS (24)
#define AUDIO_REG_SPK0_FIFO_CFG_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_REG_SPK1_FIFO_CFG_ADDR (SOC_AUDIO_REG_REG_BASE + (0x15 << 2))

#define AUDIO_REG_SPK1_FIFO_CFG_SPK1_HINT_WR_THRD_POS (0)
#define AUDIO_REG_SPK1_FIFO_CFG_SPK1_HINT_WR_THRD_MASK (0xf)

#define AUDIO_REG_SPK1_FIFO_CFG_SPK1_HINT_RD_THRD_POS (4)
#define AUDIO_REG_SPK1_FIFO_CFG_SPK1_HINT_RD_THRD_MASK (0xf)

#define AUDIO_REG_SPK1_FIFO_CFG_SPK1_CALL_WR_THRD_POS (8)
#define AUDIO_REG_SPK1_FIFO_CFG_SPK1_CALL_WR_THRD_MASK (0xf)

#define AUDIO_REG_SPK1_FIFO_CFG_SPK1_CALL_RD_THRD_POS (12)
#define AUDIO_REG_SPK1_FIFO_CFG_SPK1_CALL_RD_THRD_MASK (0xf)

#define AUDIO_REG_SPK1_FIFO_CFG_SPK1_A2DP_WR_THRD_POS (16)
#define AUDIO_REG_SPK1_FIFO_CFG_SPK1_A2DP_WR_THRD_MASK (0xf)

#define AUDIO_REG_SPK1_FIFO_CFG_SPK1_A2DP_RD_THRD_POS (20)
#define AUDIO_REG_SPK1_FIFO_CFG_SPK1_A2DP_RD_THRD_MASK (0xf)

#define AUDIO_REG_SPK1_FIFO_CFG_RESERVED_BIT_24_31_POS (24)
#define AUDIO_REG_SPK1_FIFO_CFG_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_REG_ADC_CUT_CFG_ADDR (SOC_AUDIO_REG_REG_BASE + (0x16 << 2))

#define AUDIO_REG_ADC_CUT_CFG_ADC_CUT0_POS (0)
#define AUDIO_REG_ADC_CUT_CFG_ADC_CUT0_MASK (0xf)

#define AUDIO_REG_ADC_CUT_CFG_ADC_CUT1_POS (4)
#define AUDIO_REG_ADC_CUT_CFG_ADC_CUT1_MASK (0xf)

#define AUDIO_REG_ADC_CUT_CFG_ADC_CUT2_POS (8)
#define AUDIO_REG_ADC_CUT_CFG_ADC_CUT2_MASK (0xf)

#define AUDIO_REG_ADC_CUT_CFG_ADC_CUT3_POS (12)
#define AUDIO_REG_ADC_CUT_CFG_ADC_CUT3_MASK (0xf)

#define AUDIO_REG_ADC_CUT_CFG_ADC_CUT4_POS (16)
#define AUDIO_REG_ADC_CUT_CFG_ADC_CUT4_MASK (0xf)

#define AUDIO_REG_ADC_CUT_CFG_RESERVED_BIT_20_31_POS (20)
#define AUDIO_REG_ADC_CUT_CFG_RESERVED_BIT_20_31_MASK (0xfff)

#define AUDIO_REG_IIR_SFT_CFG_ADDR (SOC_AUDIO_REG_REG_BASE + (0x17 << 2))

#define AUDIO_REG_IIR_SFT_CFG_DAC_EQ_SFT_R_SEL_0_POS (0)
#define AUDIO_REG_IIR_SFT_CFG_DAC_EQ_SFT_R_SEL_0_MASK (0x7)

#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_3_3_POS (3)
#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_3_3_MASK (0x1)

#define AUDIO_REG_IIR_SFT_CFG_DAC_EQ_SFT_R_SEL_1_POS (4)
#define AUDIO_REG_IIR_SFT_CFG_DAC_EQ_SFT_R_SEL_1_MASK (0x7)

#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_7_7_POS (7)
#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_7_7_MASK (0x1)

#define AUDIO_REG_IIR_SFT_CFG_DAC_EQ_SFT_L_SEL_0_POS (8)
#define AUDIO_REG_IIR_SFT_CFG_DAC_EQ_SFT_L_SEL_0_MASK (0x7)

#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_11_11_POS (11)
#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_11_11_MASK (0x1)

#define AUDIO_REG_IIR_SFT_CFG_DAC_EQ_SFT_L_SEL_1_POS (12)
#define AUDIO_REG_IIR_SFT_CFG_DAC_EQ_SFT_L_SEL_1_MASK (0x7)

#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_15_15_POS (15)
#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_15_15_MASK (0x1)

#define AUDIO_REG_IIR_SFT_CFG_COMP_EQ_SFT_R_SEL_0_POS (16)
#define AUDIO_REG_IIR_SFT_CFG_COMP_EQ_SFT_R_SEL_0_MASK (0x7)

#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_19_19_POS (19)
#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_19_19_MASK (0x1)

#define AUDIO_REG_IIR_SFT_CFG_COMP_EQ_SFT_R_SEL_1_POS (20)
#define AUDIO_REG_IIR_SFT_CFG_COMP_EQ_SFT_R_SEL_1_MASK (0x7)

#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_23_23_POS (23)
#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_23_23_MASK (0x1)

#define AUDIO_REG_IIR_SFT_CFG_COMP_EQ_SFT_L_SEL_0_POS (24)
#define AUDIO_REG_IIR_SFT_CFG_COMP_EQ_SFT_L_SEL_0_MASK (0x7)

#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_27_27_POS (27)
#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_27_27_MASK (0x1)

#define AUDIO_REG_IIR_SFT_CFG_COMP_EQ_SFT_L_SEL_1_POS (28)
#define AUDIO_REG_IIR_SFT_CFG_COMP_EQ_SFT_L_SEL_1_MASK (0x7)

#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_IIR_SFT_CFG_RESERVED_BIT_31_31_MASK (0x1)

