bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/soc/audio_reg_reg.h
#define AUDIO_REG_DAC_CFG1_ADDR (SOC_AUDIO_REG_REG_BASE + (0x18 << 2))

#define AUDIO_REG_DAC_CFG1_DAC_PN_CONF_POS (0)
#define AUDIO_REG_DAC_CFG1_DAC_PN_CONF_MASK (0xf)

#define AUDIO_REG_DAC_CFG1_NOTCHEN_POS (4)
#define AUDIO_REG_DAC_CFG1_NOTCHEN_MASK (0x1)

#define AUDIO_REG_DAC_CFG1_SW_BOARD_POS (5)
#define AUDIO_REG_DAC_CFG1_SW_BOARD_MASK (0xf)

#define AUDIO_REG_DAC_CFG1_RESERVED_BIT_9_9_POS (9)
#define AUDIO_REG_DAC_CFG1_RESERVED_BIT_9_9_MASK (0x1)

#define AUDIO_REG_DAC_CFG1_CFG_DAC_WAIT_CNT_POS (10)
#define AUDIO_REG_DAC_CFG1_CFG_DAC_WAIT_CNT_MASK (0x1f)

#define AUDIO_REG_DAC_CFG1_RESERVED_BIT_15_15_POS (15)
#define AUDIO_REG_DAC_CFG1_RESERVED_BIT_15_15_MASK (0x1)

#define AUDIO_REG_DAC_CFG1_DAC_EQ_BPS_POS (16)
#define AUDIO_REG_DAC_CFG1_DAC_EQ_BPS_MASK (0x3ff)

#define AUDIO_REG_DAC_CFG1_RSP_BPS_POS (26)
#define AUDIO_REG_DAC_CFG1_RSP_BPS_MASK (0x1)

#define AUDIO_REG_DAC_CFG1_DAC_FRC_O_POS (27)
#define AUDIO_REG_DAC_CFG1_DAC_FRC_O_MASK (0x1)

#define AUDIO_REG_DAC_CFG1_DAC_FRC_HW_POS (28)
#define AUDIO_REG_DAC_CFG1_DAC_FRC_HW_MASK (0x1)

#define AUDIO_REG_DAC_CFG1_DAC_FRC_HW_MASK_POS (29)
#define AUDIO_REG_DAC_CFG1_DAC_FRC_HW_MASK_MASK (0x1)

#define AUDIO_REG_DAC_CFG1_RESERVED_BIT_30_31_POS (30)
#define AUDIO_REG_DAC_CFG1_RESERVED_BIT_30_31_MASK (0x3)

#define AUDIO_REG_ANC_CFG2_ADDR (SOC_AUDIO_REG_REG_BASE + (0x19 << 2))

#define AUDIO_REG_ANC_CFG2_ANC1_SFT_SEL_1_POS (0)
#define AUDIO_REG_ANC_CFG2_ANC1_SFT_SEL_1_MASK (0x7)

#define AUDIO_REG_ANC_CFG2_ANC1_SFT_SEL_2_POS (3)
#define AUDIO_REG_ANC_CFG2_ANC1_SFT_SEL_2_MASK (0x7)

#define AUDIO_REG_ANC_CFG2_ANC1_RSHIFT0_POS (6)
#define AUDIO_REG_ANC_CFG2_ANC1_RSHIFT0_MASK (0x7)

#define AUDIO_REG_ANC_CFG2_ANC1_RSHIFT1_POS (9)
#define AUDIO_REG_ANC_CFG2_ANC1_RSHIFT1_MASK (0x7)

#define AUDIO_REG_ANC_CFG2_RESERVED_BIT_12_12_POS (12)
#define AUDIO_REG_ANC_CFG2_RESERVED_BIT_12_12_MASK (0x1)

#define AUDIO_REG_ANC_CFG2_UP_SPL_SEL_POS (13)
#define AUDIO_REG_ANC_CFG2_UP_SPL_SEL_MASK (0x3)

#define AUDIO_REG_ANC_CFG2_RESERVED_BIT_15_16_POS (15)
#define AUDIO_REG_ANC_CFG2_RESERVED_BIT_15_16_MASK (0x3)

#define AUDIO_REG_ANC_CFG2_ANC2_SFT_SEL_1_POS (17)
#define AUDIO_REG_ANC_CFG2_ANC2_SFT_SEL_1_MASK (0x7)

#define AUDIO_REG_ANC_CFG2_ANC2_SFT_SEL_2_POS (20)
#define AUDIO_REG_ANC_CFG2_ANC2_SFT_SEL_2_MASK (0x7)

#define AUDIO_REG_ANC_CFG2_ANC2_RSHIFT0_POS (23)
#define AUDIO_REG_ANC_CFG2_ANC2_RSHIFT0_MASK (0x7)

#define AUDIO_REG_ANC_CFG2_ANC2_RSHIFT1_POS (26)
#define AUDIO_REG_ANC_CFG2_ANC2_RSHIFT1_MASK (0x7)

#define AUDIO_REG_ANC_CFG2_ANC_SPL_SEL_POS (29)
#define AUDIO_REG_ANC_CFG2_ANC_SPL_SEL_MASK (0x3)

#define AUDIO_REG_ANC_CFG2_DAC_SDM_DIS_POS (31)
#define AUDIO_REG_ANC_CFG2_DAC_SDM_DIS_MASK (0x1)

#define AUDIO_REG_RAMP_UP_CFG_ADDR (SOC_AUDIO_REG_REG_BASE + (0x1a << 2))

#define AUDIO_REG_RAMP_UP_CFG_ANC_COMP_EN_POS (0)
#define AUDIO_REG_RAMP_UP_CFG_ANC_COMP_EN_MASK (0x3)

#define AUDIO_REG_RAMP_UP_CFG_COMP_RAMP_DOWN_TRIG_POS (2)
#define AUDIO_REG_RAMP_UP_CFG_COMP_RAMP_DOWN_TRIG_MASK (0x3)

#define AUDIO_REG_RAMP_UP_CFG_COMP_RAMP_CFG_POS (4)
#define AUDIO_REG_RAMP_UP_CFG_COMP_RAMP_CFG_MASK (0x7)

#define AUDIO_REG_RAMP_UP_CFG_RESERVED_BIT_7_10_POS (7)
#define AUDIO_REG_RAMP_UP_CFG_RESERVED_BIT_7_10_MASK (0xf)

#define AUDIO_REG_RAMP_UP_CFG_COMP_RAMP_BPS_POS (11)
#define AUDIO_REG_RAMP_UP_CFG_COMP_RAMP_BPS_MASK (0x3)

#define AUDIO_REG_RAMP_UP_CFG_EQ_RAMP_DOWN_TRIG_POS (13)
#define AUDIO_REG_RAMP_UP_CFG_EQ_RAMP_DOWN_TRIG_MASK (0x3)

#define AUDIO_REG_RAMP_UP_CFG_EQ_RAMP_CFG_POS (15)
#define AUDIO_REG_RAMP_UP_CFG_EQ_RAMP_CFG_MASK (0x7)

#define AUDIO_REG_RAMP_UP_CFG_RESERVED_BIT_18_21_POS (18)
#define AUDIO_REG_RAMP_UP_CFG_RESERVED_BIT_18_21_MASK (0xf)

#define AUDIO_REG_RAMP_UP_CFG_EQ_RAMP_BPS_POS (22)
#define AUDIO_REG_RAMP_UP_CFG_EQ_RAMP_BPS_MASK (0x3)

#define AUDIO_REG_RAMP_UP_CFG_EQ_RAMP_UP_TRIG_POS (24)
#define AUDIO_REG_RAMP_UP_CFG_EQ_RAMP_UP_TRIG_MASK (0x3)

#define AUDIO_REG_RAMP_UP_CFG_COMP_RAMP_UP_TRIG_POS (26)
#define AUDIO_REG_RAMP_UP_CFG_COMP_RAMP_UP_TRIG_MASK (0x3)

#define AUDIO_REG_RAMP_UP_CFG_RESERVED_BIT_28_31_POS (28)
#define AUDIO_REG_RAMP_UP_CFG_RESERVED_BIT_28_31_MASK (0xf)

#define AUDIO_REG_ANC1_GAIN_CFG1_ADDR (SOC_AUDIO_REG_REG_BASE + (0x1b << 2))

#define AUDIO_REG_ANC1_GAIN_CFG1_ANC1_GAIN1_1_POS (0)
#define AUDIO_REG_ANC1_GAIN_CFG1_ANC1_GAIN1_1_MASK (0x7fffffff)

#define AUDIO_REG_ANC1_GAIN_CFG1_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_ANC1_GAIN_CFG1_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_ANC1_GAIN_CFG2_ADDR (SOC_AUDIO_REG_REG_BASE + (0x1c << 2))

#define AUDIO_REG_ANC1_GAIN_CFG2_ANC1_GAIN_COMP_POS (0)
#define AUDIO_REG_ANC1_GAIN_CFG2_ANC1_GAIN_COMP_MASK (0x7fffffff)

#define AUDIO_REG_ANC1_GAIN_CFG2_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_ANC1_GAIN_CFG2_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_ANC1_GAIN_CFG3_ADDR (SOC_AUDIO_REG_REG_BASE + (0x1d << 2))

#define AUDIO_REG_ANC1_GAIN_CFG3_ANC1_GAIN0_1_POS (0)
#define AUDIO_REG_ANC1_GAIN_CFG3_ANC1_GAIN0_1_MASK (0x7fffffff)

#define AUDIO_REG_ANC1_GAIN_CFG3_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_ANC1_GAIN_CFG3_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_ANC1_GAIN_CFG4_ADDR (SOC_AUDIO_REG_REG_BASE + (0x1f << 2))

#define AUDIO_REG_ANC1_GAIN_CFG4_ANC1_GAIN0_0_POS (0)
#define AUDIO_REG_ANC1_GAIN_CFG4_ANC1_GAIN0_0_MASK (0x7fffffff)

#define AUDIO_REG_ANC1_GAIN_CFG4_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_ANC1_GAIN_CFG4_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_SYNC_CTRL1_ADDR (SOC_AUDIO_REG_REG_BASE + (0x20 << 2))

#define AUDIO_REG_SYNC_CTRL1_SYNC_A2DP_CNT_POS (0)
#define AUDIO_REG_SYNC_CTRL1_SYNC_A2DP_CNT_MASK (0x1fff)

#define AUDIO_REG_SYNC_CTRL1_START_A2DP_CNT_POS (13)
#define AUDIO_REG_SYNC_CTRL1_START_A2DP_CNT_MASK (0x7)

#define AUDIO_REG_SYNC_CTRL1_SYNC_CALL_CNT_POS (16)
#define AUDIO_REG_SYNC_CTRL1_SYNC_CALL_CNT_MASK (0x1fff)

#define AUDIO_REG_SYNC_CTRL1_START_CALL_CNT_POS (29)
#define AUDIO_REG_SYNC_CTRL1_START_CALL_CNT_MASK (0x7)

