bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/soc/audio_reg_reg.h
#define AUDIO_REG_SYNC_CTRL2_ADDR (SOC_AUDIO_REG_REG_BASE + (0x21 << 2))

#define AUDIO_REG_SYNC_CTRL2_SYNC_HINT_CNT_POS (0)
#define AUDIO_REG_SYNC_CTRL2_SYNC_HINT_CNT_MASK (0x1fff)

#define AUDIO_REG_SYNC_CTRL2_START_HINT_CNT_POS (13)
#define AUDIO_REG_SYNC_CTRL2_START_HINT_CNT_MASK (0x7)

#define AUDIO_REG_SYNC_CTRL2_RESERVED_BIT_16_31_POS (16)
#define AUDIO_REG_SYNC_CTRL2_RESERVED_BIT_16_31_MASK (0xffff)

#define AUDIO_REG_DAC_RO_STS_ADDR (SOC_AUDIO_REG_REG_BASE + (0x24 << 2))

#define AUDIO_REG_DAC_RO_STS_DAC_FIFO_STATUS_POS (0)
#define AUDIO_REG_DAC_RO_STS_DAC_FIFO_STATUS_MASK (0xfff)

#define AUDIO_REG_DAC_RO_STS_RESERVED_BIT_12_30_POS (12)
#define AUDIO_REG_DAC_RO_STS_RESERVED_BIT_12_30_MASK (0x7ffff)

#define AUDIO_REG_DAC_RO_STS_MEM_AUTO_INIT_DONE_POS (31)
#define AUDIO_REG_DAC_RO_STS_MEM_AUTO_INIT_DONE_MASK (0x1)

#define AUDIO_REG_ADC_RO_STS_ADDR (SOC_AUDIO_REG_REG_BASE + (0x25 << 2))

#define AUDIO_REG_ADC_RO_STS_ADC_FIFO_STATUS_POS (0)
#define AUDIO_REG_ADC_RO_STS_ADC_FIFO_STATUS_MASK (0xf)

#define AUDIO_REG_ADC_RO_STS_RESERVED_BIT_4_31_POS (4)
#define AUDIO_REG_ADC_RO_STS_RESERVED_BIT_4_31_MASK (0xfffffff)

#define AUDIO_REG_ANC_STS_ADDR (SOC_AUDIO_REG_REG_BASE + (0x26 << 2))

#define AUDIO_REG_ANC_STS_ANC_STATUS_POS (0)
#define AUDIO_REG_ANC_STS_ANC_STATUS_MASK (0xffffffff)

#define AUDIO_REG_RAMP_INTR_CTRL_ADDR (SOC_AUDIO_REG_REG_BASE + (0x27 << 2))

#define AUDIO_REG_RAMP_INTR_CTRL_RAMP_INTERRUPT_MASK_POS (0)
#define AUDIO_REG_RAMP_INTR_CTRL_RAMP_INTERRUPT_MASK_MASK (0x3ff)

#define AUDIO_REG_RAMP_INTR_CTRL_IIR_OVL_INT_MASK_POS (10)
#define AUDIO_REG_RAMP_INTR_CTRL_IIR_OVL_INT_MASK_MASK (0x3f)

#define AUDIO_REG_RAMP_INTR_CTRL_RAMP_INTERRUPT_CLR_POS (16)
#define AUDIO_REG_RAMP_INTR_CTRL_RAMP_INTERRUPT_CLR_MASK (0x3ff)

#define AUDIO_REG_RAMP_INTR_CTRL_IIR_OVL_INT_CLR_POS (26)
#define AUDIO_REG_RAMP_INTR_CTRL_IIR_OVL_INT_CLR_MASK (0x3f)

#define AUDIO_REG_AUD_INT_CTRL_ADDR (SOC_AUDIO_REG_REG_BASE + (0x28 << 2))

#define AUDIO_REG_AUD_INT_CTRL_AUD_INTERRUPT_MASK_POS (0)
#define AUDIO_REG_AUD_INT_CTRL_AUD_INTERRUPT_MASK_MASK (0xffff)

#define AUDIO_REG_AUD_INT_CTRL_AUD_INTERRUPT_CLR_POS (16)
#define AUDIO_REG_AUD_INT_CTRL_AUD_INTERRUPT_CLR_MASK (0xffff)

#define AUDIO_REG_AUD_INT_STS_ADDR (SOC_AUDIO_REG_REG_BASE + (0x29 << 2))

#define AUDIO_REG_AUD_INT_STS_AUD_INTERRUPT_STATUS_POS (0)
#define AUDIO_REG_AUD_INT_STS_AUD_INTERRUPT_STATUS_MASK (0x7fffffff)

#define AUDIO_REG_AUD_INT_STS_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_AUD_INT_STS_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_ANC2_LIMIT_CFG1_ADDR (SOC_AUDIO_REG_REG_BASE + (0x2a << 2))

#define AUDIO_REG_ANC2_LIMIT_CFG1_ANC2_LIMIT_VAL1_POS (0)
#define AUDIO_REG_ANC2_LIMIT_CFG1_ANC2_LIMIT_VAL1_MASK (0xffffff)

#define AUDIO_REG_ANC2_LIMIT_CFG1_RESERVED_BIT_24_30_POS (24)
#define AUDIO_REG_ANC2_LIMIT_CFG1_RESERVED_BIT_24_30_MASK (0x7f)

#define AUDIO_REG_ANC2_LIMIT_CFG1_ANC2_LIMIT_BPS1_POS (31)
#define AUDIO_REG_ANC2_LIMIT_CFG1_ANC2_LIMIT_BPS1_MASK (0x1)

#define AUDIO_REG_ANC2_LIMIT_CFG2_ADDR (SOC_AUDIO_REG_REG_BASE + (0x2b << 2))

#define AUDIO_REG_ANC2_LIMIT_CFG2_ANC2_LIMIT_VAL2_POS (0)
#define AUDIO_REG_ANC2_LIMIT_CFG2_ANC2_LIMIT_VAL2_MASK (0xffffff)

#define AUDIO_REG_ANC2_LIMIT_CFG2_RESERVED_BIT_24_30_POS (24)
#define AUDIO_REG_ANC2_LIMIT_CFG2_RESERVED_BIT_24_30_MASK (0x7f)

#define AUDIO_REG_ANC2_LIMIT_CFG2_ANC2_LIMIT_BPS2_POS (31)
#define AUDIO_REG_ANC2_LIMIT_CFG2_ANC2_LIMIT_BPS2_MASK (0x1)

#define AUDIO_REG_ANC1_LIMIT_CFG1_ADDR (SOC_AUDIO_REG_REG_BASE + (0x2c << 2))

#define AUDIO_REG_ANC1_LIMIT_CFG1_ANC1_LIMIT_VAL1_POS (0)
#define AUDIO_REG_ANC1_LIMIT_CFG1_ANC1_LIMIT_VAL1_MASK (0xffffff)

#define AUDIO_REG_ANC1_LIMIT_CFG1_RESERVED_BIT_24_30_POS (24)
#define AUDIO_REG_ANC1_LIMIT_CFG1_RESERVED_BIT_24_30_MASK (0x7f)

#define AUDIO_REG_ANC1_LIMIT_CFG1_ANC1_LIMIT_BPS1_POS (31)
#define AUDIO_REG_ANC1_LIMIT_CFG1_ANC1_LIMIT_BPS1_MASK (0x1)

#define AUDIO_REG_ANC1_LIMIT_CFG2_ADDR (SOC_AUDIO_REG_REG_BASE + (0x2d << 2))

#define AUDIO_REG_ANC1_LIMIT_CFG2_ANC1_LIMIT_VAL2_POS (0)
#define AUDIO_REG_ANC1_LIMIT_CFG2_ANC1_LIMIT_VAL2_MASK (0xffffff)

#define AUDIO_REG_ANC1_LIMIT_CFG2_RESERVED_BIT_24_30_POS (24)
#define AUDIO_REG_ANC1_LIMIT_CFG2_RESERVED_BIT_24_30_MASK (0x7f)

#define AUDIO_REG_ANC1_LIMIT_CFG2_ANC1_LIMIT_BPS2_POS (31)
#define AUDIO_REG_ANC1_LIMIT_CFG2_ANC1_LIMIT_BPS2_MASK (0x1)

#define AUDIO_REG_ANC2_GAIN_CFG1_ADDR (SOC_AUDIO_REG_REG_BASE + (0x2e << 2))

#define AUDIO_REG_ANC2_GAIN_CFG1_ANC2_GAIN1_1_POS (0)
#define AUDIO_REG_ANC2_GAIN_CFG1_ANC2_GAIN1_1_MASK (0x7fffffff)

#define AUDIO_REG_ANC2_GAIN_CFG1_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_ANC2_GAIN_CFG1_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_ANC2_GAIN_CFG2_ADDR (SOC_AUDIO_REG_REG_BASE + (0x2f << 2))

#define AUDIO_REG_ANC2_GAIN_CFG2_ANC2_GAIN_COMP_POS (0)
#define AUDIO_REG_ANC2_GAIN_CFG2_ANC2_GAIN_COMP_MASK (0x7fffffff)

#define AUDIO_REG_ANC2_GAIN_CFG2_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_ANC2_GAIN_CFG2_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_ANC2_GAIN_CFG3_ADDR (SOC_AUDIO_REG_REG_BASE + (0x30 << 2))

#define AUDIO_REG_ANC2_GAIN_CFG3_ANC2_GAIN0_1_POS (0)
#define AUDIO_REG_ANC2_GAIN_CFG3_ANC2_GAIN0_1_MASK (0x7fffffff)

#define AUDIO_REG_ANC2_GAIN_CFG3_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_ANC2_GAIN_CFG3_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_ANC2_GAIN_CFG4_ADDR (SOC_AUDIO_REG_REG_BASE + (0x31 << 2))

#define AUDIO_REG_ANC2_GAIN_CFG4_ANC2_GAIN0_0_POS (0)
#define AUDIO_REG_ANC2_GAIN_CFG4_ANC2_GAIN0_0_MASK (0x7fffffff)

#define AUDIO_REG_ANC2_GAIN_CFG4_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_ANC2_GAIN_CFG4_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_ANC_COMP_CFG_ADDR (SOC_AUDIO_REG_REG_BASE + (0x32 << 2))

#define AUDIO_REG_ANC_COMP_CFG_COMP_IIR_BPS_POS (0)
#define AUDIO_REG_ANC_COMP_CFG_COMP_IIR_BPS_MASK (0x3ff)

#define AUDIO_REG_ANC_COMP_CFG_DAC_COMP_SPL_POS (10)
#define AUDIO_REG_ANC_COMP_CFG_DAC_COMP_SPL_MASK (0x3)

#define AUDIO_REG_ANC_COMP_CFG_RESERVED_BIT_12_15_POS (12)
#define AUDIO_REG_ANC_COMP_CFG_RESERVED_BIT_12_15_MASK (0xf)

#define AUDIO_REG_ANC_COMP_CFG_ANC_CFG_START_VAL_POS (16)
#define AUDIO_REG_ANC_COMP_CFG_ANC_CFG_START_VAL_MASK (0x1ff)

#define AUDIO_REG_ANC_COMP_CFG_RESERVED_BIT_25_31_POS (25)
#define AUDIO_REG_ANC_COMP_CFG_RESERVED_BIT_25_31_MASK (0x7f)

#define AUDIO_REG_DAC_GAIN_CFG0_ADDR (SOC_AUDIO_REG_REG_BASE + (0x33 << 2))

#define AUDIO_REG_DAC_GAIN_CFG0_SPK0_A2DP_GAIN_POS (0)
#define AUDIO_REG_DAC_GAIN_CFG0_SPK0_A2DP_GAIN_MASK (0x7fffffff)

