bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/soc/audio_reg_reg.h
#define AUDIO_REG_DAC_GAIN_CFG0_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_DAC_GAIN_CFG0_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_DAC_GAIN_CFG1_ADDR (SOC_AUDIO_REG_REG_BASE + (0x34 << 2))

#define AUDIO_REG_DAC_GAIN_CFG1_SPK0_CALL_GAIN_POS (0)
#define AUDIO_REG_DAC_GAIN_CFG1_SPK0_CALL_GAIN_MASK (0x7fffffff)

#define AUDIO_REG_DAC_GAIN_CFG1_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_DAC_GAIN_CFG1_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_DAC_GAIN_CFG2_ADDR (SOC_AUDIO_REG_REG_BASE + (0x35 << 2))

#define AUDIO_REG_DAC_GAIN_CFG2_SPK0_HINT_GAIN_POS (0)
#define AUDIO_REG_DAC_GAIN_CFG2_SPK0_HINT_GAIN_MASK (0x7fffffff)

#define AUDIO_REG_DAC_GAIN_CFG2_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_DAC_GAIN_CFG2_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_DAC_GAIN_CFG3_ADDR (SOC_AUDIO_REG_REG_BASE + (0x36 << 2))

#define AUDIO_REG_DAC_GAIN_CFG3_SPK1_A2DP_GAIN_POS (0)
#define AUDIO_REG_DAC_GAIN_CFG3_SPK1_A2DP_GAIN_MASK (0x7fffffff)

#define AUDIO_REG_DAC_GAIN_CFG3_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_DAC_GAIN_CFG3_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_DAC_GAIN_CFG4_ADDR (SOC_AUDIO_REG_REG_BASE + (0x37 << 2))

#define AUDIO_REG_DAC_GAIN_CFG4_SPK1_CALL_GAIN_POS (0)
#define AUDIO_REG_DAC_GAIN_CFG4_SPK1_CALL_GAIN_MASK (0x7fffffff)

#define AUDIO_REG_DAC_GAIN_CFG4_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_DAC_GAIN_CFG4_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_DAC_GAIN_CFG5_ADDR (SOC_AUDIO_REG_REG_BASE + (0x38 << 2))

#define AUDIO_REG_DAC_GAIN_CFG5_SPK1_HINT_GAIN_POS (0)
#define AUDIO_REG_DAC_GAIN_CFG5_SPK1_HINT_GAIN_MASK (0x7fffffff)

#define AUDIO_REG_DAC_GAIN_CFG5_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_DAC_GAIN_CFG5_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_ADC_GAIN_CFG1_ADDR (SOC_AUDIO_REG_REG_BASE + (0x39 << 2))

#define AUDIO_REG_ADC_GAIN_CFG1_ADC_CHN1_GAIN_POS (0)
#define AUDIO_REG_ADC_GAIN_CFG1_ADC_CHN1_GAIN_MASK (0x1ffff)

#define AUDIO_REG_ADC_GAIN_CFG1_RESERVED_BIT_17_31_POS (17)
#define AUDIO_REG_ADC_GAIN_CFG1_RESERVED_BIT_17_31_MASK (0x7fff)

#define AUDIO_REG_DAC_L_GAIN_MIX_ADDR (SOC_AUDIO_REG_REG_BASE + (0x3a << 2))

#define AUDIO_REG_DAC_L_GAIN_MIX_DAC_L_GAIN_POS (0)
#define AUDIO_REG_DAC_L_GAIN_MIX_DAC_L_GAIN_MASK (0x7fffffff)

#define AUDIO_REG_DAC_L_GAIN_MIX_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_DAC_L_GAIN_MIX_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_DAC_R_GAIN_MIX_ADDR (SOC_AUDIO_REG_REG_BASE + (0x3b << 2))

#define AUDIO_REG_DAC_R_GAIN_MIX_DAC_R_GAIN_POS (0)
#define AUDIO_REG_DAC_R_GAIN_MIX_DAC_R_GAIN_MASK (0x7fffffff)

#define AUDIO_REG_DAC_R_GAIN_MIX_RESERVED_BIT_31_31_POS (31)
#define AUDIO_REG_DAC_R_GAIN_MIX_RESERVED_BIT_31_31_MASK (0x1)

#define AUDIO_REG_ADC_GAIN_CFG2_ADDR (SOC_AUDIO_REG_REG_BASE + (0x40 << 2))

#define AUDIO_REG_ADC_GAIN_CFG2_ADC_CHN0_GAIN_POS (0)
#define AUDIO_REG_ADC_GAIN_CFG2_ADC_CHN0_GAIN_MASK (0x1ffff)

#define AUDIO_REG_ADC_GAIN_CFG2_RESERVED_BIT_17_31_POS (17)
#define AUDIO_REG_ADC_GAIN_CFG2_RESERVED_BIT_17_31_MASK (0x7fff)

#define AUDIO_REG_ADC_GAIN_CFG3_ADDR (SOC_AUDIO_REG_REG_BASE + (0x41 << 2))

#define AUDIO_REG_ADC_GAIN_CFG3_ADC_CHN4_GAIN_POS (0)
#define AUDIO_REG_ADC_GAIN_CFG3_ADC_CHN4_GAIN_MASK (0x1ffff)

#define AUDIO_REG_ADC_GAIN_CFG3_RESERVED_BIT_17_31_POS (17)
#define AUDIO_REG_ADC_GAIN_CFG3_RESERVED_BIT_17_31_MASK (0x7fff)

#define AUDIO_REG_ADC_GAIN_CFG4_ADDR (SOC_AUDIO_REG_REG_BASE + (0x42 << 2))

#define AUDIO_REG_ADC_GAIN_CFG4_ADC_CHN3_GAIN_POS (0)
#define AUDIO_REG_ADC_GAIN_CFG4_ADC_CHN3_GAIN_MASK (0x1ffff)

#define AUDIO_REG_ADC_GAIN_CFG4_RESERVED_BIT_17_31_POS (17)
#define AUDIO_REG_ADC_GAIN_CFG4_RESERVED_BIT_17_31_MASK (0x7fff)

#define AUDIO_REG_ADC_GAIN_CFG5_ADDR (SOC_AUDIO_REG_REG_BASE + (0x43 << 2))

#define AUDIO_REG_ADC_GAIN_CFG5_ADC_CHN2_GAIN_POS (0)
#define AUDIO_REG_ADC_GAIN_CFG5_ADC_CHN2_GAIN_MASK (0x1ffff)

#define AUDIO_REG_ADC_GAIN_CFG5_RESERVED_BIT_17_31_POS (17)
#define AUDIO_REG_ADC_GAIN_CFG5_RESERVED_BIT_17_31_MASK (0x7fff)

#define AUDIO_REG_ANC_SFT_L_PARA_ADDR (SOC_AUDIO_REG_REG_BASE + (0x44 << 2))

#define AUDIO_REG_ANC_SFT_L_PARA_ANC_IF_SFT_L_0_POS (0)
#define AUDIO_REG_ANC_SFT_L_PARA_ANC_IF_SFT_L_0_MASK (0x7)

#define AUDIO_REG_ANC_SFT_L_PARA_RESERVED_BIT_3_3_POS (3)
#define AUDIO_REG_ANC_SFT_L_PARA_RESERVED_BIT_3_3_MASK (0x1)

#define AUDIO_REG_ANC_SFT_L_PARA_ANC_IF_SFT_L_1_POS (4)
#define AUDIO_REG_ANC_SFT_L_PARA_ANC_IF_SFT_L_1_MASK (0x7)

#define AUDIO_REG_ANC_SFT_L_PARA_RESERVED_BIT_7_7_POS (7)
#define AUDIO_REG_ANC_SFT_L_PARA_RESERVED_BIT_7_7_MASK (0x1)

#define AUDIO_REG_ANC_SFT_L_PARA_ANC_IF_SFT_L_2_POS (8)
#define AUDIO_REG_ANC_SFT_L_PARA_ANC_IF_SFT_L_2_MASK (0x7)

#define AUDIO_REG_ANC_SFT_L_PARA_RESERVED_BIT_11_11_POS (11)
#define AUDIO_REG_ANC_SFT_L_PARA_RESERVED_BIT_11_11_MASK (0x1)

#define AUDIO_REG_ANC_SFT_L_PARA_ANC_IF_SFT_L_3_POS (12)
#define AUDIO_REG_ANC_SFT_L_PARA_ANC_IF_SFT_L_3_MASK (0x7)

#define AUDIO_REG_ANC_SFT_L_PARA_RESERVED_BIT_15_15_POS (15)
#define AUDIO_REG_ANC_SFT_L_PARA_RESERVED_BIT_15_15_MASK (0x1)

#define AUDIO_REG_ANC_SFT_L_PARA_ANC_IF_SFT_L_4_POS (16)
#define AUDIO_REG_ANC_SFT_L_PARA_ANC_IF_SFT_L_4_MASK (0x7)

#define AUDIO_REG_ANC_SFT_L_PARA_RESERVED_BIT_19_19_POS (19)
#define AUDIO_REG_ANC_SFT_L_PARA_RESERVED_BIT_19_19_MASK (0x1)

#define AUDIO_REG_ANC_SFT_L_PARA_ANC_IF_SFT_L_5_POS (20)
#define AUDIO_REG_ANC_SFT_L_PARA_ANC_IF_SFT_L_5_MASK (0x7)

#define AUDIO_REG_ANC_SFT_L_PARA_RESERVED_BIT_23_31_POS (23)
#define AUDIO_REG_ANC_SFT_L_PARA_RESERVED_BIT_23_31_MASK (0x1ff)

#define AUDIO_REG_ANC_SFT_R_PARA_ADDR (SOC_AUDIO_REG_REG_BASE + (0x45 << 2))

#define AUDIO_REG_ANC_SFT_R_PARA_ANC_IF_SFT_R_0_POS (0)
#define AUDIO_REG_ANC_SFT_R_PARA_ANC_IF_SFT_R_0_MASK (0x7)

#define AUDIO_REG_ANC_SFT_R_PARA_RESERVED_BIT_3_3_POS (3)
#define AUDIO_REG_ANC_SFT_R_PARA_RESERVED_BIT_3_3_MASK (0x1)

#define AUDIO_REG_ANC_SFT_R_PARA_ANC_IF_SFT_R_1_POS (4)
#define AUDIO_REG_ANC_SFT_R_PARA_ANC_IF_SFT_R_1_MASK (0x7)

#define AUDIO_REG_ANC_SFT_R_PARA_RESERVED_BIT_7_7_POS (7)
#define AUDIO_REG_ANC_SFT_R_PARA_RESERVED_BIT_7_7_MASK (0x1)

#define AUDIO_REG_ANC_SFT_R_PARA_ANC_IF_SFT_R_2_POS (8)
#define AUDIO_REG_ANC_SFT_R_PARA_ANC_IF_SFT_R_2_MASK (0x7)

#define AUDIO_REG_ANC_SFT_R_PARA_RESERVED_BIT_11_11_POS (11)
#define AUDIO_REG_ANC_SFT_R_PARA_RESERVED_BIT_11_11_MASK (0x1)

#define AUDIO_REG_ANC_SFT_R_PARA_ANC_IF_SFT_R_3_POS (12)
#define AUDIO_REG_ANC_SFT_R_PARA_ANC_IF_SFT_R_3_MASK (0x7)

#define AUDIO_REG_ANC_SFT_R_PARA_RESERVED_BIT_15_15_POS (15)
#define AUDIO_REG_ANC_SFT_R_PARA_RESERVED_BIT_15_15_MASK (0x1)

#define AUDIO_REG_ANC_SFT_R_PARA_ANC_IF_SFT_R_4_POS (16)
#define AUDIO_REG_ANC_SFT_R_PARA_ANC_IF_SFT_R_4_MASK (0x7)

#define AUDIO_REG_ANC_SFT_R_PARA_RESERVED_BIT_19_19_POS (19)
#define AUDIO_REG_ANC_SFT_R_PARA_RESERVED_BIT_19_19_MASK (0x1)

#define AUDIO_REG_ANC_SFT_R_PARA_ANC_IF_SFT_R_5_POS (20)
#define AUDIO_REG_ANC_SFT_R_PARA_ANC_IF_SFT_R_5_MASK (0x7)

