bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/soc/audio_reg_reg.h
#define AUDIO_REG_ANC_SFT_R_PARA_RESERVED_BIT_23_31_POS (23)
#define AUDIO_REG_ANC_SFT_R_PARA_RESERVED_BIT_23_31_MASK (0x1ff)

#define AUDIO_REG_K_VAL_0_ADDR (SOC_AUDIO_REG_REG_BASE + (0x46 << 2))

#define AUDIO_REG_K_VAL_0_K_VAL_0_POS (0)
#define AUDIO_REG_K_VAL_0_K_VAL_0_MASK (0xffff)

#define AUDIO_REG_K_VAL_0_RESERVED_BIT_16_31_POS (16)
#define AUDIO_REG_K_VAL_0_RESERVED_BIT_16_31_MASK (0xffff)

#define AUDIO_REG_K_VAL_1_ADDR (SOC_AUDIO_REG_REG_BASE + (0x47 << 2))

#define AUDIO_REG_K_VAL_1_K_VAL_1_POS (0)
#define AUDIO_REG_K_VAL_1_K_VAL_1_MASK (0xffff)

#define AUDIO_REG_K_VAL_1_RESERVED_BIT_16_31_POS (16)
#define AUDIO_REG_K_VAL_1_RESERVED_BIT_16_31_MASK (0xffff)

#define AUDIO_REG_K_VAL_2_ADDR (SOC_AUDIO_REG_REG_BASE + (0x48 << 2))

#define AUDIO_REG_K_VAL_2_K_VAL_2_POS (0)
#define AUDIO_REG_K_VAL_2_K_VAL_2_MASK (0xffff)

#define AUDIO_REG_K_VAL_2_RESERVED_BIT_16_31_POS (16)
#define AUDIO_REG_K_VAL_2_RESERVED_BIT_16_31_MASK (0xffff)

#define AUDIO_REG_K_VAL_3_ADDR (SOC_AUDIO_REG_REG_BASE + (0x49 << 2))

#define AUDIO_REG_K_VAL_3_K_VAL_3_POS (0)
#define AUDIO_REG_K_VAL_3_K_VAL_3_MASK (0xffff)

#define AUDIO_REG_K_VAL_3_RESERVED_BIT_16_31_POS (16)
#define AUDIO_REG_K_VAL_3_RESERVED_BIT_16_31_MASK (0xffff)

#define AUDIO_REG_K_VAL_4_ADDR (SOC_AUDIO_REG_REG_BASE + (0x4a << 2))

#define AUDIO_REG_K_VAL_4_K_VAL_4_POS (0)
#define AUDIO_REG_K_VAL_4_K_VAL_4_MASK (0xffff)

#define AUDIO_REG_K_VAL_4_RESERVED_BIT_16_31_POS (16)
#define AUDIO_REG_K_VAL_4_RESERVED_BIT_16_31_MASK (0xffff)

#define AUDIO_REG_K_VAL_5_ADDR (SOC_AUDIO_REG_REG_BASE + (0x4b << 2))

#define AUDIO_REG_K_VAL_5_K_VAL_5_POS (0)
#define AUDIO_REG_K_VAL_5_K_VAL_5_MASK (0xffff)

#define AUDIO_REG_K_VAL_5_RESERVED_BIT_16_31_POS (16)
#define AUDIO_REG_K_VAL_5_RESERVED_BIT_16_31_MASK (0xffff)

#define AUDIO_REG_K_VAL_6_ADDR (SOC_AUDIO_REG_REG_BASE + (0x4c << 2))

#define AUDIO_REG_K_VAL_6_K_VAL_6_POS (0)
#define AUDIO_REG_K_VAL_6_K_VAL_6_MASK (0xffff)

#define AUDIO_REG_K_VAL_6_RESERVED_BIT_16_31_POS (16)
#define AUDIO_REG_K_VAL_6_RESERVED_BIT_16_31_MASK (0xffff)

#define AUDIO_REG_K_VAL_7_ADDR (SOC_AUDIO_REG_REG_BASE + (0x4d << 2))

#define AUDIO_REG_K_VAL_7_K_VAL_7_POS (0)
#define AUDIO_REG_K_VAL_7_K_VAL_7_MASK (0xffff)

#define AUDIO_REG_K_VAL_7_RESERVED_BIT_16_31_POS (16)
#define AUDIO_REG_K_VAL_7_RESERVED_BIT_16_31_MASK (0xffff)

#define AUDIO_REG_ST_VAL_0_ADDR (SOC_AUDIO_REG_REG_BASE + (0x4e << 2))

#define AUDIO_REG_ST_VAL_0_ST_VAL_0_POS (0)
#define AUDIO_REG_ST_VAL_0_ST_VAL_0_MASK (0xffffff)

#define AUDIO_REG_ST_VAL_0_RESERVED_BIT_24_31_POS (24)
#define AUDIO_REG_ST_VAL_0_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_REG_ST_VAL_1_ADDR (SOC_AUDIO_REG_REG_BASE + (0x4f << 2))

#define AUDIO_REG_ST_VAL_1_ST_VAL_1_POS (0)
#define AUDIO_REG_ST_VAL_1_ST_VAL_1_MASK (0xffffff)

#define AUDIO_REG_ST_VAL_1_RESERVED_BIT_24_31_POS (24)
#define AUDIO_REG_ST_VAL_1_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_REG_ST_VAL_2_ADDR (SOC_AUDIO_REG_REG_BASE + (0x50 << 2))

#define AUDIO_REG_ST_VAL_2_ST_VAL_2_POS (0)
#define AUDIO_REG_ST_VAL_2_ST_VAL_2_MASK (0xffffff)

#define AUDIO_REG_ST_VAL_2_RESERVED_BIT_24_31_POS (24)
#define AUDIO_REG_ST_VAL_2_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_REG_ST_VAL_3_ADDR (SOC_AUDIO_REG_REG_BASE + (0x51 << 2))

#define AUDIO_REG_ST_VAL_3_ST_VAL_3_POS (0)
#define AUDIO_REG_ST_VAL_3_ST_VAL_3_MASK (0xffffff)

#define AUDIO_REG_ST_VAL_3_RESERVED_BIT_24_31_POS (24)
#define AUDIO_REG_ST_VAL_3_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_REG_ST_VAL_4_ADDR (SOC_AUDIO_REG_REG_BASE + (0x52 << 2))

#define AUDIO_REG_ST_VAL_4_ST_VAL_4_POS (0)
#define AUDIO_REG_ST_VAL_4_ST_VAL_4_MASK (0xffffff)

#define AUDIO_REG_ST_VAL_4_RESERVED_BIT_24_31_POS (24)
#define AUDIO_REG_ST_VAL_4_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_REG_ST_VAL_5_ADDR (SOC_AUDIO_REG_REG_BASE + (0x53 << 2))

#define AUDIO_REG_ST_VAL_5_ST_VAL_5_POS (0)
#define AUDIO_REG_ST_VAL_5_ST_VAL_5_MASK (0xffffff)

#define AUDIO_REG_ST_VAL_5_RESERVED_BIT_24_31_POS (24)
#define AUDIO_REG_ST_VAL_5_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_REG_ST_VAL_6_ADDR (SOC_AUDIO_REG_REG_BASE + (0x54 << 2))

#define AUDIO_REG_ST_VAL_6_ST_VAL_6_POS (0)
#define AUDIO_REG_ST_VAL_6_ST_VAL_6_MASK (0xffffff)

#define AUDIO_REG_ST_VAL_6_RESERVED_BIT_24_31_POS (24)
#define AUDIO_REG_ST_VAL_6_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_REG_ST_VAL_7_ADDR (SOC_AUDIO_REG_REG_BASE + (0x55 << 2))

#define AUDIO_REG_ST_VAL_7_ST_VAL_7_POS (0)
#define AUDIO_REG_ST_VAL_7_ST_VAL_7_MASK (0xffffff)

#define AUDIO_REG_ST_VAL_7_RESERVED_BIT_24_31_POS (24)
#define AUDIO_REG_ST_VAL_7_RESERVED_BIT_24_31_MASK (0xff)

#define AUDIO_REG_P_VAL_0_ADDR (SOC_AUDIO_REG_REG_BASE + (0x56 << 2))

#define AUDIO_REG_P_VAL_0_P_VAL_0_POS (0)
#define AUDIO_REG_P_VAL_0_P_VAL_0_MASK (0xff)

#define AUDIO_REG_P_VAL_0_RESERVED_BIT_8_31_POS (8)
#define AUDIO_REG_P_VAL_0_RESERVED_BIT_8_31_MASK (0xffffff)

#define AUDIO_REG_P_VAL_1_ADDR (SOC_AUDIO_REG_REG_BASE + (0x57 << 2))

#define AUDIO_REG_P_VAL_1_P_VAL_1_POS (0)
#define AUDIO_REG_P_VAL_1_P_VAL_1_MASK (0xff)

#define AUDIO_REG_P_VAL_1_RESERVED_BIT_8_31_POS (8)
#define AUDIO_REG_P_VAL_1_RESERVED_BIT_8_31_MASK (0xffffff)

#define AUDIO_REG_P_VAL_2_ADDR (SOC_AUDIO_REG_REG_BASE + (0x58 << 2))

#define AUDIO_REG_P_VAL_2_P_VAL_2_POS (0)
#define AUDIO_REG_P_VAL_2_P_VAL_2_MASK (0xff)

#define AUDIO_REG_P_VAL_2_RESERVED_BIT_8_31_POS (8)
#define AUDIO_REG_P_VAL_2_RESERVED_BIT_8_31_MASK (0xffffff)

#define AUDIO_REG_P_VAL_3_ADDR (SOC_AUDIO_REG_REG_BASE + (0x59 << 2))

#define AUDIO_REG_P_VAL_3_P_VAL_3_POS (0)
#define AUDIO_REG_P_VAL_3_P_VAL_3_MASK (0xff)

#define AUDIO_REG_P_VAL_3_RESERVED_BIT_8_31_POS (8)
#define AUDIO_REG_P_VAL_3_RESERVED_BIT_8_31_MASK (0xffffff)

#define AUDIO_REG_P_VAL_4_ADDR (SOC_AUDIO_REG_REG_BASE + (0x5a << 2))

#define AUDIO_REG_P_VAL_4_P_VAL_4_POS (0)
#define AUDIO_REG_P_VAL_4_P_VAL_4_MASK (0xff)

#define AUDIO_REG_P_VAL_4_RESERVED_BIT_8_31_POS (8)
#define AUDIO_REG_P_VAL_4_RESERVED_BIT_8_31_MASK (0xffffff)

