bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/soc/audio_reg_reg.h
#define AUDIO_REG_P_VAL_5_ADDR (SOC_AUDIO_REG_REG_BASE + (0x5b << 2))

#define AUDIO_REG_P_VAL_5_P_VAL_5_POS (0)
#define AUDIO_REG_P_VAL_5_P_VAL_5_MASK (0xff)

#define AUDIO_REG_P_VAL_5_RESERVED_BIT_8_31_POS (8)
#define AUDIO_REG_P_VAL_5_RESERVED_BIT_8_31_MASK (0xffffff)

#define AUDIO_REG_P_VAL_6_ADDR (SOC_AUDIO_REG_REG_BASE + (0x5c << 2))

#define AUDIO_REG_P_VAL_6_P_VAL_6_POS (0)
#define AUDIO_REG_P_VAL_6_P_VAL_6_MASK (0xff)

#define AUDIO_REG_P_VAL_6_RESERVED_BIT_8_31_POS (8)
#define AUDIO_REG_P_VAL_6_RESERVED_BIT_8_31_MASK (0xffffff)

#define AUDIO_REG_ANC_IIR_BPS_ADDR (SOC_AUDIO_REG_REG_BASE + (0x5d << 2))

#define AUDIO_REG_ANC_IIR_BPS_ANC_IIR_BPS0_POS (0)
#define AUDIO_REG_ANC_IIR_BPS_ANC_IIR_BPS0_MASK (0x3ff)

#define AUDIO_REG_ANC_IIR_BPS_ANC_IIR_BPS1_POS (10)
#define AUDIO_REG_ANC_IIR_BPS_ANC_IIR_BPS1_MASK (0x3ff)

#define AUDIO_REG_ANC_IIR_BPS_ANC_IIR_BPS2_POS (20)
#define AUDIO_REG_ANC_IIR_BPS_ANC_IIR_BPS2_MASK (0x3ff)

#define AUDIO_REG_ANC_IIR_BPS_RESERVED_BIT_30_31_POS (30)
#define AUDIO_REG_ANC_IIR_BPS_RESERVED_BIT_30_31_MASK (0x3)

#define AUDIO_REG_INTERFACE_MATRIX_ADDR (SOC_AUDIO_REG_REG_BASE + (0x5e << 2))

#define AUDIO_REG_INTERFACE_MATRIX_ADC_CHN0_SEL_POS (0)
#define AUDIO_REG_INTERFACE_MATRIX_ADC_CHN0_SEL_MASK (0x7)

#define AUDIO_REG_INTERFACE_MATRIX_RESERVED_BIT_3_3_POS (3)
#define AUDIO_REG_INTERFACE_MATRIX_RESERVED_BIT_3_3_MASK (0x1)

#define AUDIO_REG_INTERFACE_MATRIX_ADC_CHN1_SEL_POS (4)
#define AUDIO_REG_INTERFACE_MATRIX_ADC_CHN1_SEL_MASK (0x7)

#define AUDIO_REG_INTERFACE_MATRIX_RESERVED_BIT_7_7_POS (7)
#define AUDIO_REG_INTERFACE_MATRIX_RESERVED_BIT_7_7_MASK (0x1)

#define AUDIO_REG_INTERFACE_MATRIX_ADC_CHN2_SEL_POS (8)
#define AUDIO_REG_INTERFACE_MATRIX_ADC_CHN2_SEL_MASK (0x7)

#define AUDIO_REG_INTERFACE_MATRIX_RESERVED_BIT_11_11_POS (11)
#define AUDIO_REG_INTERFACE_MATRIX_RESERVED_BIT_11_11_MASK (0x1)

#define AUDIO_REG_INTERFACE_MATRIX_ADC_CHN3_SEL_POS (12)
#define AUDIO_REG_INTERFACE_MATRIX_ADC_CHN3_SEL_MASK (0x7)

#define AUDIO_REG_INTERFACE_MATRIX_RESERVED_BIT_15_15_POS (15)
#define AUDIO_REG_INTERFACE_MATRIX_RESERVED_BIT_15_15_MASK (0x1)

#define AUDIO_REG_INTERFACE_MATRIX_ADC_CHN4_SEL_POS (16)
#define AUDIO_REG_INTERFACE_MATRIX_ADC_CHN4_SEL_MASK (0x7)

#define AUDIO_REG_INTERFACE_MATRIX_RESERVED_BIT_19_19_POS (19)
#define AUDIO_REG_INTERFACE_MATRIX_RESERVED_BIT_19_19_MASK (0x1)

#define AUDIO_REG_INTERFACE_MATRIX_DAC_R_CHN_SEL_POS (20)
#define AUDIO_REG_INTERFACE_MATRIX_DAC_R_CHN_SEL_MASK (0x1)

#define AUDIO_REG_INTERFACE_MATRIX_DAC_L_CHN_SEL_POS (21)
#define AUDIO_REG_INTERFACE_MATRIX_DAC_L_CHN_SEL_MASK (0x1)

#define AUDIO_REG_INTERFACE_MATRIX_CLK_FRC_ON_POS (22)
#define AUDIO_REG_INTERFACE_MATRIX_CLK_FRC_ON_MASK (0x1f)

#define AUDIO_REG_INTERFACE_MATRIX_RESERVED_BIT_27_31_POS (27)
#define AUDIO_REG_INTERFACE_MATRIX_RESERVED_BIT_27_31_MASK (0x1f)

#ifdef __cplusplus
}
#endif
